Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D27CLD1G.atdf
      <value-group caption="Clock Selection" name="FLEX_US_MR__USCLKS">
        <value caption="Peripheral clock is selected" name="MCK" value="0x0"/>
        <value caption="Peripheral clock divided (DIV = 8) is selected" name="DIV" value="0x1"/>
        <value caption="PMC generic clock is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1." name="GCLK" value="0x2"/>
        <value caption="External pin SCK is selected" name="SCK" value="0x3"/>
      </value-group>
      <value-group caption="Character Length" name="FLEX_US_MR__CHRL">
        <value caption="Character length is 5 bits" name="5_BIT" value="0x0"/>
        <value caption="Character length is 6 bits" name="6_BIT" value="0x1"/>
        <value caption="Character length is 7 bits" name="7_BIT" value="0x2"/>
        <value caption="Character length is 8 bits" name="8_BIT" value="0x3"/>
      </value-group>
      <value-group caption="Parity Type" name="FLEX_US_MR__PAR">
        <value caption="Even parity" name="EVEN" value="0x0"/>
        <value caption="Odd parity" name="ODD" value="0x1"/>
        <value caption="Parity forced to 0 (Space)" name="SPACE" value="0x2"/>
        <value caption="Parity forced to 1 (Mark)" name="MARK" value="0x3"/>
        <value caption="No parity" name="NO" value="0x4"/>
        <value caption="Multidrop mode" name="MULTIDROP" value="0x6"/>
      </value-group>
      <value-group caption="Number of Stop Bits" name="FLEX_US_MR__NBSTOP">
        <value caption="1 stop bit" name="1_BIT" value="0x0"/>
        <value caption="1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)" name="1_5_BIT" value="0x1"/>
        <value caption="2 stop bits" name="2_BIT" value="0x2"/>
      </value-group>
      <value-group caption="Channel Mode" name="FLEX_US_MR__CHMODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="Automatic Echo. Receiver input is connected to the TXD pin." name="AUTOMATIC" value="0x1"/>
        <value caption="Local Loopback. Transmitter output is connected to the Receiver Input." name="LOCAL_LOOPBACK" value="0x2"/>
        <value caption="Remote Loopback. RXD pin is internally connected to the TXD pin." name="REMOTE_LOOPBACK" value="0x3"/>
      </value-group>
      <value-group caption="USART Mode of Operation" name="FLEX_US_MR_SPI_MODE__USART_MODE">
        <value caption="SPI master" name="SPI_MASTER" value="0xE"/>
        <value caption="SPI slave" name="SPI_SLAVE" value="0xF"/>
      </value-group>
      <value-group caption="Clock Selection" name="FLEX_US_MR_SPI_MODE__USCLKS">
        <value caption="Peripheral clock is selected" name="MCK" value="0x0"/>
        <value caption="Peripheral clock Divided (DIV= 8) is selected" name="DIV" value="0x1"/>
        <value caption="A PMC generic clock is selected" name="GCLK" value="0x2"/>
        <value caption="External pin SCK is selected" name="SCK" value="0x3"/>
      </value-group>
      <value-group caption="Character Length" name="FLEX_US_MR_SPI_MODE__CHRL">
        <value caption="Character length is 8 bits" name="8_BIT" value="0x3"/>
      </value-group>
      <value-group caption="Transmitter Preamble Pattern" name="FLEX_US_MAN__TX_PP">
        <value caption="The preamble is composed of '1's" name="ALL_ONE" value="0x0"/>
        <value caption="The preamble is composed of '0's" name="ALL_ZERO" value="0x1"/>
        <value caption="The preamble is composed of '01's" name="ZERO_ONE" value="0x2"/>
        <value caption="The preamble is composed of '10's" name="ONE_ZERO" value="0x3"/>
      </value-group>
      <value-group caption="Receiver Preamble Pattern detected" name="FLEX_US_MAN__RX_PP">
        <value caption="The preamble is composed of '1's" name="ALL_ONE" value="0x0"/>
        <value caption="The preamble is composed of '0's" name="ALL_ZERO" value="0x1"/>
        <value caption="The preamble is composed of '01's" name="ZERO_ONE" value="0x2"/>
        <value caption="The preamble is composed of '10's" name="ONE_ZERO" value="0x3"/>
      </value-group>
      <value-group caption="LIN Node Action" name="FLEX_US_LINMR__NACT">
        <value caption="The USART transmits the response." name="PUBLISH" value="0x0"/>
        <value caption="The USART receives the response." name="SUBSCRIBE" value="0x1"/>
        <value caption="The USART does not transmit and does not receive the response." name="IGNORE" value="0x2"/>
      </value-group>
      <value-group caption="Comparison Mode" name="FLEX_US_CMPR__CMPMODE">
        <value caption="Any character is received and comparison function drives CMP flag." name="FLAG_ONLY" value="0"/>
        <value caption="Comparison condition must be met to start reception." name="START_CONDITION" value="1"/>
      </value-group>
      <value-group caption="Transmitter Ready Mode" name="FLEX_US_FMR__TXRDYM">
        <value caption="TXRDY will be at level '1' when at least one data can be written in the Transmit FIFO" name="ONE_DATA" value="0x0"/>
        <value caption="TXRDY will be at level '1' when at least two data can be written in the Transmit FIFO" name="TWO_DATA" value="0x1"/>
        <value caption="TXRDY will be at level '1' when at least four data can be written in the Transmit FIFO" name="FOUR_DATA" value="0x2"/>
      </value-group>
      <value-group caption="Receiver Ready Mode" name="FLEX_US_FMR__RXRDYM">
        <value caption="RXRDY will be at level '1' when at least one unread data is in the Receive FIFO" name="ONE_DATA" value="0x0"/>
        <value caption="RXRDY will be at level '1' when at least two unread data are in the Receive FIFO" name="TWO_DATA" value="0x1"/>
        <value caption="RXRDY will be at level '1' when at least four unread data are in the Receive FIFO" name="FOUR_DATA" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Key" name="FLEX_US_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of bit WPEN. Always reads as 0." name="PASSWD" value="0x555341"/>
      </value-group>
