Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D27CLD1G.atdf
        <register caption="Debug Control Register" name="L2CC_DCR" offset="0xF40" rw="RW" size="4">
          <bitfield caption="Disable Cache Linefill" mask="0x00000001" name="DCL"/>
          <bitfield caption="Disable Write-back, Force Write-through" mask="0x00000002" name="DWB"/>
          <bitfield caption="SPNIDEN Value" mask="0x00000004" name="SPNIDEN"/>
        </register>
        <register caption="Prefetch Control Register" name="L2CC_PCR" offset="0xF60" rw="RW" size="4">
          <bitfield caption="Prefetch Offset" mask="0x0000001F" name="OFFSET"/>
          <bitfield caption="Not Same ID on Exclusive Sequence Enable" mask="0x00200000" name="NSIDEN"/>
          <bitfield caption="INCR Double Linefill Enable" mask="0x00800000" name="IDLEN"/>
          <bitfield caption="Prefetch Drop Enable" mask="0x01000000" name="PDEN"/>
          <bitfield caption="Double Linefill on WRAP Read Disable" mask="0x08000000" name="DLFWRDIS"/>
          <bitfield caption="Data Prefetch Enable" mask="0x10000000" name="DATPEN"/>
          <bitfield caption="Instruction Prefetch Enable" mask="0x20000000" name="INSPEN"/>
          <bitfield caption="Double Linefill Enable" mask="0x40000000" name="DLEN"/>
        </register>
        <register caption="Power Control Register" name="L2CC_POWCR" offset="0xF80" rw="RW" size="4">
          <bitfield caption="Standby Mode Enable" mask="0x00000001" name="STBYEN"/>
          <bitfield caption="Dynamic Clock Gating Enable" mask="0x00000002" name="DCKGATEN"/>
        </register>
      </register-group>
      <value-group caption="Way Size" name="L2CC_ACR__WAYSIZE">
        <value caption="16-Kbyte way set associative" name="_16KB_WAY" value="0x1"/>
      </value-group>
      <value-group caption="Event Counter Interrupt Generation" name="L2CC_ECFGR1__EIGEN">
        <value caption="Disables (default)" name="INT_DIS" value="0x0"/>
        <value caption="Enables with Increment condition" name="INT_EN_INCR" value="0x1"/>
        <value caption="Enables with Overflow condition" name="INT_EN_OVER" value="0x2"/>
        <value caption="Disables Interrupt generation" name="INT_GEN_DIS" value="0x3"/>
      </value-group>
      <value-group caption="Event Counter Source" name="L2CC_ECFGR1__ESRC">
        <value caption="Counter Disabled" name="CNT_DIS" value="0x0"/>
        <value caption="Source is CO" name="SRC_CO" value="0x1"/>
        <value caption="Source is DRHIT" name="SRC_DRHIT" value="0x2"/>
        <value caption="Source is DRREQ" name="SRC_DRREQ" value="0x3"/>
        <value caption="Source is DWHIT" name="SRC_DWHIT" value="0x4"/>
        <value caption="Source is DWREQ" name="SRC_DWREQ" value="0x5"/>
        <value caption="Source is DWTREQ" name="SRC_DWTREQ" value="0x6"/>
        <value caption="Source is IRHIT" name="SRC_IRHIT" value="0x7"/>
        <value caption="Source is IRREQ" name="SRC_IRREQ" value="0x8"/>
        <value caption="Source is WA" name="SRC_WA" value="0x9"/>
        <value caption="Source is IPFALLOC" name="SRC_IPFALLOC" value="0xa"/>
        <value caption="Source is EPFHIT" name="SRC_EPFHIT" value="0xb"/>
        <value caption="Source is EPFALLOC" name="SRC_EPFALLOC" value="0xc"/>
        <value caption="Source is SRRCVD" name="SRC_SRRCVD" value="0xd"/>
        <value caption="Source is SRCONF" name="SRC_SRCONF" value="0xe"/>
        <value caption="Source is EPFRCVD" name="SRC_EPFRCVD" value="0xf"/>
      </value-group>
      <value-group caption="Event Counter Interrupt Generation" name="L2CC_ECFGR0__EIGEN">
        <value caption="Disables (default)" name="INT_DIS" value="0x0"/>
        <value caption="Enables with Increment condition" name="INT_EN_INCR" value="0x1"/>
        <value caption="Enables with Overflow condition" name="INT_EN_OVER" value="0x2"/>
        <value caption="Disables Interrupt generation" name="INT_GEN_DIS" value="0x3"/>
      </value-group>
      <value-group caption="Event Counter Source" name="L2CC_ECFGR0__ESRC">
        <value caption="Counter Disabled" name="CNT_DIS" value="0x0"/>
        <value caption="Source is CO" name="SRC_CO" value="0x1"/>
        <value caption="Source is DRHIT" name="SRC_DRHIT" value="0x2"/>
        <value caption="Source is DRREQ" name="SRC_DRREQ" value="0x3"/>
        <value caption="Source is DWHIT" name="SRC_DWHIT" value="0x4"/>
        <value caption="Source is DWREQ" name="SRC_DWREQ" value="0x5"/>
        <value caption="Source is DWTREQ" name="SRC_DWTREQ" value="0x6"/>
        <value caption="Source is IRHIT" name="SRC_IRHIT" value="0x7"/>
        <value caption="Source is IRREQ" name="SRC_IRREQ" value="0x8"/>
        <value caption="Source is WA" name="SRC_WA" value="0x9"/>
        <value caption="Source is IPFALLOC" name="SRC_IPFALLOC" value="0xa"/>
        <value caption="Source is EPFHIT" name="SRC_EPFHIT" value="0xb"/>
        <value caption="Source is EPFALLOC" name="SRC_EPFALLOC" value="0xc"/>
        <value caption="Source is SRRCVD" name="SRC_SRRCVD" value="0xd"/>
        <value caption="Source is SRCONF" name="SRC_SRCONF" value="0xe"/>
        <value caption="Source is EPFRCVD" name="SRC_EPFRCVD" value="0xf"/>
      </value-group>
    </module>
    <module caption="LCD Controller" id="11062" name="LCDC" version="P">
      <register-group name="LCDC">
        <register caption="LCD Controller Configuration Register 0" name="LCDC_LCDCFG0" offset="0x00000000" rw="RW" size="4">
          <bitfield caption="LCD Controller Clock Polarity" mask="0x00000001" name="CLKPOL"/>
          <bitfield caption="LCD Controller Clock Source Selection" mask="0x00000004" name="CLKSEL"/>
          <bitfield caption="LCD Controller PWM Clock Source Selection" mask="0x00000008" name="CLKPWMSEL"/>
          <bitfield caption="Clock Gating Disable Control for the Base Layer" mask="0x00000100" name="CGDISBASE"/>
          <bitfield caption="Clock Gating Disable Control for the Overlay 1 Layer" mask="0x00000200" name="CGDISOVR1"/>
          <bitfield caption="Clock Gating Disable Control for the Overlay 2 Layer" mask="0x00000400" name="CGDISOVR2"/>
          <bitfield caption="Clock Gating Disable Control for the High-End Overlay" mask="0x00000800" name="CGDISHEO"/>
          <bitfield caption="Clock Gating Disable Control for the Post Processing Layer" mask="0x00002000" name="CGDISPP"/>
          <bitfield caption="LCD Controller Clock Divider" mask="0x00FF0000" name="CLKDIV"/>
        </register>
        <register caption="LCD Controller Configuration Register 1" name="LCDC_LCDCFG1" offset="0x00000004" rw="RW" size="4">
          <bitfield caption="Horizontal Synchronization Pulse Width" mask="0x000003FF" name="HSPW"/>
          <bitfield caption="Vertical Synchronization Pulse Width" mask="0x03FF0000" name="VSPW"/>
        </register>
