Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D27CLD1G.atdf
      <value-group caption="Command Complete Signal Enable" name="SDMMC_NISIER_E_MMC__CMDC">
        <value caption="No interrupt is generated when the CMDC status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the CMDC status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Transfer Complete Signal Enable" name="SDMMC_NISIER_E_MMC__TRFC">
        <value caption="No interrupt is generated when the TRFC status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the TRFC status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Block Gap Event Signal Enable" name="SDMMC_NISIER_E_MMC__BLKGE">
        <value caption="No interrupt is generated when the BLKGE status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the BLKGE status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="DMA Interrupt Signal Enable" name="SDMMC_NISIER_E_MMC__DMAINT">
        <value caption="No interrupt is generated when the DMAINT status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the DMAINT status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Buffer Write Ready Signal Enable" name="SDMMC_NISIER_E_MMC__BWRRDY">
        <value caption="No interrupt is generated when the BWRRDY status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the BWRRDY status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Buffer Read Ready Signal Enable" name="SDMMC_NISIER_E_MMC__BRDRDY">
        <value caption="No interrupt is generated when the BRDRDY status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the BRDRDY status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Boot Acknowledge Received Signal Enable" name="SDMMC_NISIER_E_MMC__BOOTAR">
        <value caption="No interrupt is generated when the BOOTAR status rises in SDMMC_NISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the BOOTAR status rises in SDMMC_NISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Timeout Error Signal Enable" name="SDMMC_EISIER__CMDTEO">
        <value caption="No interrupt is generated when the CMDTEO status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the CMDTEO status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command CRC Error Signal Enable" name="SDMMC_EISIER__CMDCRC">
        <value caption="No interrupt is generated when the CDMCRC status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the CMDCRC status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command End Bit Error Signal Enable" name="SDMMC_EISIER__CMDEND">
        <value caption="No interrupt is generated when the CMDEND status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the CMDEND status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Index Error Signal Enable" name="SDMMC_EISIER__CMDIDX">
        <value caption="No interrupt is generated when the CMDIDX status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the CMDIDX status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data Timeout Error Signal Enable" name="SDMMC_EISIER__DATTEO">
        <value caption="No interrupt is generated when the DATTEO status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the DATTEO status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data CRC Error Signal Enable" name="SDMMC_EISIER__DATCRC">
        <value caption="No interrupt is generated when the DATCRC status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the DATCRC status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Data End Bit Error Signal Enable" name="SDMMC_EISIER__DATEND">
        <value caption="No interrupt is generated when the DATEND status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the DATEND status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Current Limit Error Signal Enable" name="SDMMC_EISIER__CURLIM">
        <value caption="No interrupt is generated when the CURLIM status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the CURLIM status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Auto CMD Error Signal Enable" name="SDMMC_EISIER__ACMD">
        <value caption="No interrupt is generated when the ACMD status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the ACMD status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="ADMA Error Signal Enable" name="SDMMC_EISIER__ADMA">
        <value caption="No interrupt is generated when the ADMA status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the ADMA status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Timeout Error Signal Enable" name="SDMMC_EISIER_E_MMC__CMDTEO">
        <value caption="No interrupt is generated when the CMDTEO status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the CMDTEO status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command CRC Error Signal Enable" name="SDMMC_EISIER_E_MMC__CMDCRC">
        <value caption="No interrupt is generated when the CDMCRC status rises in SDMMC_EISTR." name="MASKED" value="0"/>
        <value caption="An interrupt is generated when the CMDCRC status rises in SDMMC_EISTR." name="ENABLED" value="1"/>
      </value-group>
