Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D27CLD1G.atdf
      <value-group caption="RC Compare Effect on TIOAx" name="TC_CMR0__ACPC">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="External Event Effect on TIOAx" name="TC_CMR0__AEEVT">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="Software Trigger Effect on TIOAx" name="TC_CMR0__ASWTRG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="RB Compare Effect on TIOBx" name="TC_CMR0__BCPB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="RC Compare Effect on TIOBx" name="TC_CMR0__BCPC">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="External Event Effect on TIOBx" name="TC_CMR0__BEEVT">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="Software Trigger Effect on TIOBx" name="TC_CMR0__BSWTRG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="Trigger Source for Input A" name="TC_EMR0__TRIGSRCA">
        <value caption="The trigger/capture input A is driven by external pin TIOAx" name="EXTERNAL_TIOAx" value="0"/>
        <value caption="The trigger/capture input A is driven internally by PWMx" name="PWMx" value="1"/>
      </value-group>
      <value-group caption="Trigger Source for Input B" name="TC_EMR0__TRIGSRCB">
        <value caption="The trigger/capture input B is driven by external pin TIOBx" name="EXTERNAL_TIOBx" value="0"/>
        <value caption="For TC0 to TC10: The trigger/capture input B is driven internally by the comparator output (see Figure 7-16) of the PWMx.For TC11: The trigger/capture input B is driven internally by the GTSUCOMP signal of the Ethernet MAC (GMAC)." name="PWMx" value="1"/>
      </value-group>
      <value-group caption="External Clock Signal 0 Selection" name="TC_BMR__TC0XC0S">
        <value caption="Signal connected to XC0: TCLK0" name="TCLK0" value="0x0"/>
        <value caption="Signal connected to XC0: TIOA1" name="TIOA1" value="0x2"/>
        <value caption="Signal connected to XC0: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="External Clock Signal 1 Selection" name="TC_BMR__TC1XC1S">
        <value caption="Signal connected to XC1: TCLK1" name="TCLK1" value="0x0"/>
        <value caption="Signal connected to XC1: TIOA0" name="TIOA0" value="0x2"/>
        <value caption="Signal connected to XC1: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="External Clock Signal 2 Selection" name="TC_BMR__TC2XC2S">
        <value caption="Signal connected to XC2: TCLK2" name="TCLK2" value="0x0"/>
        <value caption="Signal connected to XC2: TIOA0" name="TIOA0" value="0x2"/>
        <value caption="Signal connected to XC2: TIOA1" name="TIOA1" value="0x3"/>
      </value-group>
      <value-group caption="AutoCorrection of missing pulses" name="TC_BMR__AUTOC">
        <value caption="The detection and autocorrection function is disabled." name="DISABLED" value="0"/>
        <value caption="The detection and autocorrection function is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Write Protection Key" name="TC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x54494D"/>
      </value-group>
    </module>
    <module caption="Triple Data Encryption Standard" id="6150" name="TDES" version="N">
      <register-group name="TDES">
        <register caption="Control Register" name="TDES_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Start Processing" mask="0x00000001" name="START"/>
          <bitfield caption="Software Reset" mask="0x00000100" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="TDES_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Processing Mode" mask="0x00000001" name="CIPHER" values="TDES_MR__CIPHER"/>
          <bitfield caption="ALGORITHM Mode" mask="0x00000006" name="TDESMOD" values="TDES_MR__TDESMOD"/>
          <bitfield caption="Key Mode" mask="0x00000010" name="KEYMOD"/>
          <bitfield caption="Start Mode" mask="0x00000300" name="SMOD" values="TDES_MR__SMOD"/>
          <bitfield caption="Operating Mode" mask="0x00003000" name="OPMOD" values="TDES_MR__OPMOD"/>
          <bitfield caption="Last Output Data Mode" mask="0x00008000" name="LOD"/>
          <bitfield caption="Cipher Feedback Data Size" mask="0x00030000" name="CFBS" values="TDES_MR__CFBS"/>
        </register>
        <register caption="Interrupt Enable Register" name="TDES_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Enable" mask="0x00000100" name="URAD"/>
        </register>
        <register caption="Interrupt Disable Register" name="TDES_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Disable" mask="0x00000100" name="URAD"/>
        </register>
        <register caption="Interrupt Mask Register" name="TDES_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Mask" mask="0x00000100" name="URAD"/>
        </register>
        <register caption="Interrupt Status Register" name="TDES_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready (cleared by setting bit START or bit SWRST in TDES_CR or by reading TDES_ODATARx)" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Status (cleared by setting bit TDES_CR.SWRST)" mask="0x00000100" name="URAD"/>
          <bitfield caption="Unspecified Register Access (cleared by setting bit TDES_CR.SWRST)" mask="0x00003000" name="URAT" values="TDES_ISR__URAT"/>
        </register>
