Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D27CLD1G.atdf
        <register caption="Receive Holding Register" name="UART_RHR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000000FF" name="RXCHR"/>
        </register>
        <register caption="Transmit Holding Register" name="UART_THR" offset="0x001C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000000FF" name="TXCHR"/>
        </register>
        <register caption="Baud Rate Generator Register" name="UART_BRGR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Clock Divisor" mask="0x0000FFFF" name="CD"/>
        </register>
        <register caption="Comparison Register" name="UART_CMPR" offset="0x0024" rw="RW" size="4">
          <bitfield caption="First Comparison Value for Received Character" mask="0x000000FF" name="VAL1"/>
          <bitfield caption="Comparison Mode" mask="0x00001000" name="CMPMODE" values="UART_CMPR__CMPMODE"/>
          <bitfield caption="Compare Parity" mask="0x00004000" name="CMPPAR"/>
          <bitfield caption="Second Comparison Value for Received Character" mask="0x00FF0000" name="VAL2"/>
        </register>
        <register caption="Receiver Time-out Register" name="UART_RTOR" offset="0x0028" rw="RW" size="4">
          <bitfield caption="Time-out Value" mask="0x000000FF" name="TO"/>
        </register>
        <register caption="Write Protection Mode Register" name="UART_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="UART_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="Receiver Digital Filter" name="UART_MR__FILTER">
        <value caption="UART does not filter the receive line." name="DISABLED" value="0"/>
        <value caption="UART filters the receive line using a three-sample filter (16x-bit clock) (2 over 3 majority)." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Parity Type" name="UART_MR__PAR">
        <value caption="Even Parity" name="EVEN" value="0x0"/>
        <value caption="Odd Parity" name="ODD" value="0x1"/>
        <value caption="Space: parity forced to 0" name="SPACE" value="0x2"/>
        <value caption="Mark: parity forced to 1" name="MARK" value="0x3"/>
        <value caption="No parity" name="NO" value="0x4"/>
      </value-group>
      <value-group caption="Baud Rate Source Clock" name="UART_MR__BRSRCCK">
        <value caption="The baud rate is driven by the peripheral clock" name="PERIPH_CLK" value="0"/>
        <value caption="The baud rate is driven by a PMC-programmable clock GCLK (see section Power Management Controller (PMC))." name="GCLK" value="1"/>
      </value-group>
      <value-group caption="Channel Mode" name="UART_MR__CHMODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="Automatic echo" name="AUTOMATIC" value="0x1"/>
        <value caption="Local loopback" name="LOCAL_LOOPBACK" value="0x2"/>
        <value caption="Remote loopback" name="REMOTE_LOOPBACK" value="0x3"/>
      </value-group>
      <value-group caption="Comparison Mode" name="UART_CMPR__CMPMODE">
        <value caption="Any character is received and comparison function drives CMP flag." name="FLAG_ONLY" value="0"/>
        <value caption="Comparison condition must be met to start reception." name="START_CONDITION" value="1"/>
      </value-group>
      <value-group caption="Write Protection Key" name="UART_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x554152"/>
      </value-group>
    </module>
    <module caption="USB High Speed Device Port" id="6227" name="UDPHS" version="V">
      <register-group name="UDPHS_DMA" size="16">
        <register caption="UDPHS DMA Next Descriptor Address Register (channel = 0)" name="UDPHS_DMANXTDSC" offset="0x0" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="UDPHS DMA Channel Address Register (channel = 0)" name="UDPHS_DMAADDRESS" offset="0x4" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="UDPHS DMA Channel Control Register (channel = 0)" name="UDPHS_DMACONTROL" offset="0x8" rw="RW" size="4">
          <bitfield caption="(Channel Enable Command)" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable (Command)" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable (Control)" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable (Control)" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="UDPHS DMA Channel Status Register (channel = 0)" name="UDPHS_DMASTATUS" offset="0xC" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
      </register-group>
      <register-group name="UDPHS_EPT" size="32">
        <register caption="UDPHS Endpoint Configuration Register (endpoint = 0)" name="UDPHS_EPTCFG" offset="0x0" rw="RW" size="4">
          <bitfield caption="Endpoint Size (cleared upon USB reset)" mask="0x00000007" name="EPT_SIZE" values="UDPHS_EPTCFG0__EPT_SIZE"/>
          <bitfield caption="Endpoint Direction (cleared upon USB reset)" mask="0x00000008" name="EPT_DIR"/>
          <bitfield caption="Endpoint Type (cleared upon USB reset)" mask="0x00000030" name="EPT_TYPE" values="UDPHS_EPTCFG0__EPT_TYPE"/>
          <bitfield caption="Number of Banks (cleared upon USB reset)" mask="0x000000C0" name="BK_NUMBER" values="UDPHS_EPTCFG0__BK_NUMBER"/>
          <bitfield caption="Number Of Transaction per Microframe (cleared upon USB reset)" mask="0x00000300" name="NB_TRANS"/>
          <bitfield caption="Endpoint Mapped (cleared upon USB reset)" mask="0x80000000" name="EPT_MAPD"/>
        </register>
