Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/atdf/ATSAMA5D27CLD1G.atdf
        <register-group caption="Channel Intterupt Enable Register" count="16" name="XDMAC_CHID" name-in-module="XDMAC_CHID" offset="0x50" size="64"/>
      </register-group>
      <value-group caption="Channel x Next Descriptor Enable" name="XDMAC_CNDC__NDE">
        <value caption="Descriptor fetch is disabled." name="DSCR_FETCH_DIS" value="0"/>
        <value caption="Descriptor fetch is enabled." name="DSCR_FETCH_EN" value="1"/>
      </value-group>
      <value-group caption="Channel x Next Descriptor Source Update" name="XDMAC_CNDC__NDSUP">
        <value caption="Source parameters remain unchanged." name="SRC_PARAMS_UNCHANGED" value="0"/>
        <value caption="Source parameters are updated when the descriptor is retrieved." name="SRC_PARAMS_UPDATED" value="1"/>
      </value-group>
      <value-group caption="Channel x Next Descriptor Destination Update" name="XDMAC_CNDC__NDDUP">
        <value caption="Destination parameters remain unchanged." name="DST_PARAMS_UNCHANGED" value="0"/>
        <value caption="Destination parameters are updated when the descriptor is retrieved." name="DST_PARAMS_UPDATED" value="1"/>
      </value-group>
      <value-group caption="Channel x Next Descriptor View" name="XDMAC_CNDC__NDVIEW">
        <value caption="Next Descriptor View 0" name="NDV0" value="0x0"/>
        <value caption="Next Descriptor View 1" name="NDV1" value="0x1"/>
        <value caption="Next Descriptor View 2" name="NDV2" value="0x2"/>
        <value caption="Next Descriptor View 3" name="NDV3" value="0x3"/>
      </value-group>
      <value-group caption="Channel x Transfer Type" name="XDMAC_CC__TYPE">
        <value caption="Self-triggered mode (memory-to-memory transfer)." name="MEM_TRAN" value="0"/>
        <value caption="Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer)." name="PER_TRAN" value="1"/>
      </value-group>
      <value-group caption="Channel x Memory Burst Size" name="XDMAC_CC__MBSIZE">
        <value caption="The memory burst size is set to one." name="SINGLE" value="0x0"/>
        <value caption="The memory burst size is set to four." name="FOUR" value="0x1"/>
        <value caption="The memory burst size is set to eight." name="EIGHT" value="0x2"/>
        <value caption="The memory burst size is set to sixteen." name="SIXTEEN" value="0x3"/>
      </value-group>
      <value-group caption="Channel x Synchronization" name="XDMAC_CC__DSYNC">
        <value caption="Peripheral-to-memory transfer." name="PER2MEM" value="0"/>
        <value caption="Memory-to-peripheral transfer." name="MEM2PER" value="1"/>
      </value-group>
      <value-group caption="Channel x Protection" name="XDMAC_CC__PROT">
        <value caption="Channel is secured." name="SEC" value="0"/>
        <value caption="Channel is unsecured." name="UNSEC" value="1"/>
      </value-group>
      <value-group caption="Channel x Software Request Trigger" name="XDMAC_CC__SWREQ">
        <value caption="Hardware request line is connected to the peripheral request line." name="HWR_CONNECTED" value="0"/>
        <value caption="Software request is connected to the peripheral request line." name="SWR_CONNECTED" value="1"/>
      </value-group>
      <value-group caption="Channel x Fill Block of Memory" name="XDMAC_CC__MEMSET">
        <value caption="Memset is not activated." name="NORMAL_MODE" value="0"/>
        <value caption="Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis." name="HW_MODE" value="1"/>
      </value-group>
      <value-group caption="Channel x Chunk Size" name="XDMAC_CC__CSIZE">
        <value caption="1 data transferred" name="CHK_1" value="0x0"/>
        <value caption="2 data transferred" name="CHK_2" value="0x1"/>
        <value caption="4 data transferred" name="CHK_4" value="0x2"/>
        <value caption="8 data transferred" name="CHK_8" value="0x3"/>
        <value caption="16 data transferred" name="CHK_16" value="0x4"/>
      </value-group>
      <value-group caption="Channel x Data Width" name="XDMAC_CC__DWIDTH">
        <value caption="The data size is set to 8 bits" name="BYTE" value="0x0"/>
        <value caption="The data size is set to 16 bits" name="HALFWORD" value="0x1"/>
        <value caption="The data size is set to 32 bits" name="WORD" value="0x2"/>
        <value caption="The data size is set to 64 bits" name="DWORD" value="0x3"/>
      </value-group>
      <value-group caption="Channel x Source Interface Identifier" name="XDMAC_CC__SIF">
        <value caption="The data is read through the system bus interface 0." name="AHB_IF0" value="0"/>
        <value caption="The data is read through the system bus interface 1." name="AHB_IF1" value="1"/>
      </value-group>
      <value-group caption="Channel x Destination Interface Identifier" name="XDMAC_CC__DIF">
        <value caption="The data is written through the system bus interface 0." name="AHB_IF0" value="0"/>
        <value caption="The data is written though the system bus interface 1." name="AHB_IF1" value="1"/>
      </value-group>
      <value-group caption="Channel x Source Addressing Mode" name="XDMAC_CC__SAM">
        <value caption="The address remains unchanged." name="FIXED_AM" value="0x0"/>
        <value caption="The addressing mode is incremented (the increment size is set to the data size)." name="INCREMENTED_AM" value="0x1"/>
        <value caption="The microblock stride is added at the microblock boundary." name="UBS_AM" value="0x2"/>
        <value caption="The microblock stride is added at the microblock boundary, the data stride is added at the data boundary." name="UBS_DS_AM" value="0x3"/>
      </value-group>
      <value-group caption="Channel x Destination Addressing Mode" name="XDMAC_CC__DAM">
        <value caption="The address remains unchanged." name="FIXED_AM" value="0x0"/>
        <value caption="The addressing mode is incremented (the increment size is set to the data size)." name="INCREMENTED_AM" value="0x1"/>
        <value caption="The microblock stride is added at the microblock boundary." name="UBS_AM" value="0x2"/>
        <value caption="The microblock stride is added at the microblock boundary; the data stride is added at the data boundary." name="UBS_DS_AM" value="0x3"/>
      </value-group>
      <value-group caption="Channel Initialization Done (this bit is read-only)" name="XDMAC_CC__INITD">
        <value caption="Channel initialization is in progress." name="IN_PROGRESS" value="0"/>
        <value caption="Channel initialization is completed." name="TERMINATED" value="1"/>
      </value-group>
      <value-group caption="Read in Progress (this bit is read-only)" name="XDMAC_CC__RDIP">
        <value caption="No active read transaction on the bus." name="DONE" value="0"/>
        <value caption="A read transaction is in progress." name="IN_PROGRESS" value="1"/>
      </value-group>
      <value-group caption="Write in Progress (this bit is read-only)" name="XDMAC_CC__WRIP">
        <value caption="No active write transaction on the bus." name="DONE" value="0"/>
        <value caption="A write transaction is in progress." name="IN_PROGRESS" value="1"/>
      </value-group>
      <value-group caption="" name="XDMAC_CC__PERID">
        <value caption="TWIHS0_TX" name="THIHS0_TX" value="0"/>
        <value caption="TWIHS0_RX" name="THIHS0_RX" value="1"/>
        <value caption="TWIHS1_TX" name="THIHS1_TX" value="2"/>
        <value caption="TWIHS1_RX" name="THIHS1_RX" value="3"/>
        <value caption="QSPI0_TX" name="QSPI0_TX" value="4"/>
        <value caption="QSPI0_RX" name="QSPI0_RX" value="5"/>
        <value caption="SPI0_TX" name="SPI0_TX" value="6"/>
        <value caption="SPI0_RX" name="SPI0_RX" value="7"/>
        <value caption="SPI1_TX" name="SPI1_TX" value="8"/>
        <value caption="SPI1_RX" name="SPI1_RX" value="9"/>
        <value caption="PWM" name="PWM" value="10"/>
        <value caption="FLEXCOM0_TX" name="FLEXCOM0_TX" value="11"/>
        <value caption="FLEXCOM0_RX" name="FLEXCOM0_RX" value="12"/>
        <value caption="FLEXCOM1_TX" name="FLEXCOM1_TX" value="13"/>
        <value caption="FLEXCOM1_RX" name="FLEXCOM1_RX" value="14"/>
        <value caption="FLEXCOM2_TX" name="FLEXCOM2_TX" value="15"/>
        <value caption="FLEXCOM2_RX" name="FLEXCOM2_RX" value="16"/>
        <value caption="FLEXCOM3_TX" name="FLEXCOM3_TX" value="17"/>
        <value caption="FLEXCOM3_RX" name="FLEXCOM3_RX" value="18"/>
        <value caption="FLEXCOM4_TX" name="FLEXCOM4_TX" value="19"/>
        <value caption="FLEXCOM4_RX" name="FLEXCOM4_RX" value="20"/>
        <value caption="SSC0_TX" name="SSC0_TX" value="21"/>
        <value caption="SSC0_RX" name="SSC0_RX" value="22"/>
        <value caption="SSC1_TX" name="SSC1_TX" value="23"/>
        <value caption="SSC1_RX" name="SSC1_RX" value="24"/>
        <value caption="ADC" name="ADC" value="25"/>
        <value caption="AES_TX" name="AES_TX" value="26"/>
        <value caption="AES_RX" name="AES_RX" value="27"/>
        <value caption="TDES_TX" name="TDES_TX" value="28"/>
        <value caption="TDES_RX" name="TDES_RX" value="29"/>
        <value caption="SHA" name="SHA" value="30"/>
        <value caption="I2SC0_TX" name="I2SC0_TX" value="31"/>
        <value caption="I2SC0_RX" name="I2SC0_RX" value="32"/>
        <value caption="I2SC1_TX" name="I2SC1_TX" value="33"/>
        <value caption="I2SC1_RX" name="I2SC1_RX" value="34"/>
        <value caption="UART0_TX" name="UART0_TX" value="35"/>
        <value caption="UART0_RX" name="UART0_RX" value="36"/>
        <value caption="UART1_TX" name="UART1_TX" value="37"/>
        <value caption="UART1_RX" name="UART1_RX" value="38"/>
        <value caption="UART2_TX" name="UART2_TX" value="39"/>
        <value caption="UART2_RX" name="UART2_RX" value="40"/>
        <value caption="UART3_TX" name="UART3_TX" value="41"/>
        <value caption="UART3_RX" name="UART3_RX" value="42"/>
        <value caption="UART4_TX" name="UART4_TX" value="43"/>
        <value caption="UART4_RX" name="UART4_RX" value="44"/>
        <value caption="TC0" name="TC0" value="45"/>
        <value caption="TC1" name="TC1" value="46"/>
        <value caption="CLASSD" name="CLASSD" value="47"/>
        <value caption="QSPI1_TX" name="QSPI1_TX" value="48"/>
        <value caption="QSPI1_RX" name="QSPI1_RX" value="49"/>
        <value caption="PDMIC" name="PDMIC" value="50"/>
      </value-group>
    </module>
